xml-v4/DataProcessors/TL_Загрузка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>TL_Загрузка</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

xml-v4/InformationRegisters/TL_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>TL_Настройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xml-v4/DataProcessors/TL_Загрузка/Forms/Форма/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Обработка TL_Загрузка, Форма
// Расширение TradeLedger v3 — рабочее место бухгалтера
//
// Двухпанельная раскладка:
//   ГруппаФильтры       — КодСтанции, ТипДокументаФильтр, ДатаНачала, ДатаОкончания, [Обновить]
//   ГруппаОсновная (горизонтально 50/50):
//     ├── ГруппаЛевая (ДОКУМЕНТЫ 1С)
//     │   ├── ВнутренниеДанные (таблица)
//     │   └── [Провести] [Распровести] [Удалить] [Выбрать все]
//     └── ГруппаПравая (ВНЕШНИЕ ДАННЫЕ)
//         ├── ВнешниеДанные (таблица)
//         └── [◀ Загрузить выбранные] [Выбрать все]
//   HTMLДашборд        — ПолеHTMLДокумента (верхняя полоса с KPI-карточками)
//   ГруппаДетали       — HTMLДетали (ПолеHTMLДокумента, разворачиваемая)
//   ГруппаНижняя (горизонтально):
//     ├── ТекстЛога     — лог операций
//     └── ГруппаНастройки — URLСервера, Логин, Пароль, КодСистемы (свёрнута)
//
// Реквизиты формы:
//   Простые: URLСервера, Логин, Пароль, КодСистемы, КодСтанции,
//            ДатаНачала, ДатаОкончания, ТипДокументаФильтр,
//            ТекстЛога, ТокенAPI, HTMLДашборд, HTMLДетали
//   Таблицы:
//     ВнешниеДанные (9 колонок): Отметка, ТипДокумента, Дата, Станция,
//       НомерСмены, Описание, Сумма, КлючЗагрузки, ДанныеJSON
//     ВнутренниеДанные (11 колонок): Отметка, Статус, ТипДокумента, Дата,
//       Станция, Описание, Сумма, КлючЗагрузки, КлючБазовый, ДанныеJSON, ДокументПредставление
//
// Команды (8):
//   КомандаОбновить, КомандаЗагрузить, КомандаПровести, КомандаРаспровести,
//   КомандаУдалить, КомандаВыбратьВсеВнешние, КомандаВыбратьВсеВнутренние
//
// Настройки/маппинг — через TL_Настройки, TL_РегистрСтатусов (v4).
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ДатаНачала = НачалоМесяца(ТекущаяДата());
	ДатаОкончания = ТекущаяДата();
	ТипДокументаФильтр = "Все";
	КодСтанции = 0;

	ЗагрузитьНастройки();

	Если Не ЗначениеЗаполнено(URLСервера) Тогда
		URLСервера = "https://pos.autooplata.ru/tms";
	КонецЕсли;

	// Инициализация HTML-панелей
	HTMLДашборд = TL_HTMLГенератор.СформироватьДашборд(0, 0, 0, 0, 0);
	HTMLДетали = TL_HTMLГенератор.ПустыеДетали();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)

	Если Не ПроверитьНастройки() Тогда
		Возврат;
	КонецЕсли;

	ДобавитьВЛог("Обновление данных...");
	ОбновитьДанныеНаСервере();
	ДобавитьВЛог("Внешних: " + ВнешниеДанные.Количество()
		+ ", в 1С: " + ВнутренниеДанные.Количество());

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВыбранные(Команда)

	КолОтмеченных = ПодсчитатьОтмеченные(ВнешниеДанные);
	Если КолОтмеченных = 0 Тогда
		ПоказатьПредупреждение(, "Отметьте строки для загрузки");
		Возврат;
	КонецЕсли;

	ДобавитьВЛог("Загрузка " + КолОтмеченных + " документов...");
	ЗагрузитьВыбранныеНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПровестиВыбранные(Команда)

	КолОтмеченных = ПодсчитатьОтмеченные(ВнутренниеДанные);
	Если КолОтмеченных = 0 Тогда
		ПоказатьПредупреждение(, "Отметьте строки для проведения");
		Возврат;
	КонецЕсли;

	ДобавитьВЛог("Проведение " + КолОтмеченных + " документов...");
	ПровестиВыбранныеНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура РаспровестиВыбранные(Команда)

	КолОтмеченных = ПодсчитатьОтмеченные(ВнутренниеДанные);
	Если КолОтмеченных = 0 Тогда
		ПоказатьПредупреждение(, "Отметьте строки для распроведения");
		Возврат;
	КонецЕсли;

	ДобавитьВЛог("Распроведение " + КолОтмеченных + " документов...");
	РаспровестиВыбранныеНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура УдалитьВыбранные(Команда)

	КолОтмеченных = ПодсчитатьОтмеченные(ВнутренниеДанные);
	Если КолОтмеченных = 0 Тогда
		ПоказатьПредупреждение(, "Отметьте строки для удаления");
		Возврат;
	КонецЕсли;

	ТекстВопроса = "Пометить на удаление " + КолОтмеченных + " документ(ов)?"
		+ Символы.ПС + "Проведённые документы будут сначала распроведены.";
	ПоказатьВопрос(Новый ОписаниеОповещения("УдалитьВыбранныеЗавершение", ЭтотОбъект),
		ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);

КонецПроцедуры

&НаКлиенте
Процедура УдалитьВыбранныеЗавершение(Результат, ДопПараметры) Экспорт

	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	КолОтмеченных = ПодсчитатьОтмеченные(ВнутренниеДанные);
	ДобавитьВЛог("Удаление " + КолОтмеченных + " документов...");
	УдалитьВыбранныеНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсеВнешние(Команда)
	ПереключитьОтметки(ВнешниеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсеВнутренние(Команда)
	ПереключитьОтметки(ВнутренниеДанные);
КонецПроцедуры

// Открыть HTML-настройки в панели деталей
&НаКлиенте
Процедура ОткрытьНастройки(Команда)
	ОткрытьНастройкиНаСервере();
	ДобавитьВЛог("Открыты настройки маппинга");
КонецПроцедуры

// Открыть отдельную форму деталей документа (на весь экран).
//
&НаКлиенте
Процедура ОткрытьФормуДеталей(ТипДокумента, ДанныеJSON, ЗаголовокДетали)

	Если Не ЗначениеЗаполнено(ДанныеJSON) Тогда
		Возврат;
	КонецЕсли;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипДокумента", ТипДокумента);
	ПараметрыФормы.Вставить("ДанныеJSON", ДанныеJSON);
	ПараметрыФормы.Вставить("Заголовок", ЗаголовокДетали);

	ОткрытьФорму("Обработка.TL_Загрузка.Форма.ФормаДетали",
		ПараметрыФормы, ЭтотОбъект, , , , ,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

// При нажатии кнопки "Сохранить" в HTML-настройках.
// ID кнопки = "btnSave", данные в window.settingsJSON.
//
&НаКлиенте
Процедура HTMLДеталиПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)

	Если ДанныеСобытия.Element = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ИдЭлемента = "";
	Попытка ИдЭлемента = ДанныеСобытия.Element.id; Исключение КонецПопытки;

	// --- Кнопка "Сохранить" настройки ---
	Если ИдЭлемента = "btnSave" Тогда
		СтандартнаяОбработка = Ложь;
		Попытка
			СтрокаJSON = Элементы.HTMLДетали.Документ.defaultView.settingsJSON;
		Исключение
			СтрокаJSON = Неопределено;
		КонецПопытки;
		Если СтрокаJSON <> Неопределено И ЗначениеЗаполнено(СтрокаJSON) Тогда
			СохранитьНастройкиИзHTML(СтрокаJSON);
			ДобавитьВЛог("Настройки сохранены");
		КонецЕсли;
		Возврат;
	КонецЕсли;

КонецПроцедуры

// При активизации строки — ничего не делаем (подавляем старое поведение).
//
&НаКлиенте
Процедура ВнешниеДанныеПриАктивизацииСтроки(Элемент)
КонецПроцедуры

// По двойному клику — открыть полноэкранную форму деталей.
//
&НаКлиенте
Процедура ВнешниеДанныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	// Не открывать при клике на колонку "Отметка" (галочка)
	Если Поле.Имя = "ВнешниеДанныеОтметка" Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ОткрытьФормуДеталей(
		ТекущаяСтрока.ТипДокумента,
		ТекущаяСтрока.ДанныеJSON,
		ТекущаяСтрока.Описание + ", АЗС " + ТекущаяСтрока.Станция
			+ ", " + Формат(ТекущаяСтрока.Дата, "ДФ='dd.MM.yyyy'"));

КонецПроцедуры

// При активизации строки в левой панели — ничего не делаем.
//
&НаКлиенте
Процедура ВнутренниеДанныеПриАктивизацииСтроки(Элемент)
КонецПроцедуры

// По двойному клику в левой панели — открыть полноэкранную форму деталей.
// Если JSON нет (ранее загруженный документ) — подгрузить из API.
//
&НаКлиенте
Процедура ВнутренниеДанныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя = "ВнутренниеДанныеОтметка" Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	// Определить тип базового документа
	КлючБаз = ТекущаяСтрока.КлючБазовый;
	ТипДок = СокрЛП(ТекущаяСтрока.ТипДокумента);
	Если ТипДок = "Перемещение" ИЛИ ТипДок = "Комплектация" Тогда
		Если СтрНайти(КлючБаз, "|СМЕНА|") > 0 Тогда
			ТипДок = "Смена";
		ИначеЕсли СтрНайти(КлючБаз, "|ТТН|") > 0 Тогда
			ТипДок = "ТТН";
		КонецЕсли;
	КонецЕсли;

	// Ищем JSON в таблицах текущей сессии
	ДанныеJSON = НайтиJSONПоКлючу(КлючБаз);

	// Если JSON нет — подгрузить из API по ключу
	Если Не ЗначениеЗаполнено(ДанныеJSON) Тогда
		ДанныеJSON = ПодгрузитьJSONИзAPI(КлючБаз, ТипДок);
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ДанныеJSON) Тогда
		ДобавитьВЛог("Нет данных для просмотра — API недоступен или документ не найден");
		Возврат;
	КонецЕсли;

	ОткрытьФормуДеталей(ТипДок, ДанныеJSON,
		СокрЛП(ТекущаяСтрока.Описание) + ", АЗС " + ТекущаяСтрока.Станция
			+ ", " + Формат(ТекущаяСтрока.Дата, "ДФ='dd.MM.yyyy'"));

КонецПроцедуры

// Подгрузить JSON из API по ключу загрузки.
// Ключ: TL|СМЕНА|65|5|91 → система=65, станция=5, смена=91
// Ключ: TL|ТТН|65|5|12345 → система=65, станция=5, ТТН=12345
//
&НаСервере
Функция ПодгрузитьJSONИзAPI(КлючБазовый, ТипДок)

	Части = СтрРазделить(КлючБазовый, "|");
	// TL|СМЕНА|65|5|91 → Части[2]=система, Части[3]=станция, Части[4]=номер
	Если Части.Количество() < 5 Тогда
		Возврат "";
	КонецЕсли;

	КодСистемы_API = Число(Части[2]);
	КодСтанции_API = Число(Части[3]);
	НомерСмены_API = Число(Части[4]);

	Если Не ЗначениеЗаполнено(URLСервера) Тогда
		Возврат "";
	КонецЕсли;

	// Авторизация (или кэш)
	Токен = ТокенAPI;
	Если Не ЗначениеЗаполнено(Токен) Тогда
		Попытка
			Токен = TL_ApiКлиент.Авторизация(URLСервера, Логин, Пароль, КодСистемы_API);
			ТокенAPI = Токен;
		Исключение
			Возврат "";
		КонецПопытки;
	КонецЕсли;

	Если ТипДок = "Смена" Тогда
		Попытка
			Отчёт = TL_ApiКлиент.ПолучитьСменныйОтчёт(
				URLСервера, Токен, КодСистемы_API, КодСтанции_API, НомерСмены_API);
			Если Отчёт <> Неопределено Тогда
				Если ТипЗнч(Отчёт) = Тип("Соответствие") Тогда
					Отчёт.Вставить("station", КодСтанции_API);
				КонецЕсли;
				Возврат TL_ApiКлиент.ОбъектВJSON(Отчёт);
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;

	Возврат "";

КонецФункции

// Собрать связанные документы для панели деталей (смена или ТТН).
//
&НаКлиенте
Функция СобратьСвязанныеДокументыДляДеталей(КлючБазовый)

	Связанные = Новый Массив;
	Для Каждого Стр Из ВнутренниеДанные Цикл
		Если Стр.КлючБазовый = КлючБазовый И Стр.КлючЗагрузки <> КлючБазовый Тогда
			СвязДок = Новый Структура("ТипДокумента, Описание, Статус");
			СвязДок.ТипДокумента = Стр.ТипДокумента;
			СвязДок.Описание = Стр.Описание;
			СвязДок.Статус = Стр.Статус;
			Связанные.Добавить(СвязДок);
		КонецЕсли;
	КонецЦикла;

	Возврат Связанные;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ==========================================================================
//  ОБНОВЛЕНИЕ ДАННЫХ (загрузка списка из API + сверка с 1С)
// ==========================================================================

&НаСервере
Процедура ОбновитьДанныеНаСервере()

	ВнешниеДанные.Очистить();
	ВнутренниеДанные.Очистить();
	HTMLДетали = TL_HTMLГенератор.ПустыеДетали();

	Если Не ЗначениеЗаполнено(ТипДокументаФильтр) Тогда
		ТипДокументаФильтр = "Все";
	КонецЕсли;

	СохранитьНастройки();

	// --- 1. Авторизация ---
	Токен = ТокенAPI;
	Если Не ЗначениеЗаполнено(Токен) Тогда
		Попытка
			Токен = TL_ApiКлиент.Авторизация(URLСервера, Логин, Пароль, КодСистемы);
		Исключение
			ДобавитьВЛогСервер("Исключение при авторизации: " + ОписаниеОшибки());
			Возврат;
		КонецПопытки;
		Если Не ЗначениеЗаполнено(Токен) Тогда
			ДобавитьВЛогСервер("Ошибка авторизации (пустой токен). Проверьте URL/логин/пароль");
			Возврат;
		КонецЕсли;
		ТокенAPI = Токен;
		ДобавитьВЛогСервер("Авторизация — OK (новый токен)");
	Иначе
		ДобавитьВЛогСервер("API — OK (кэшированный токен)");
	КонецЕсли;

	// --- Валидация периода ---
	Если ДатаНачала > ДатаОкончания Тогда
		ДобавитьВЛогСервер("Ошибка: дата начала (" + Формат(ДатаНачала, "ДФ='dd.MM.yyyy'")
			+ ") позже даты окончания (" + Формат(ДатаОкончания, "ДФ='dd.MM.yyyy'") + ")");
		Возврат;
	КонецЕсли;

	// --- 2. Обнаружение ненастроенных станций ---
	Если КодСтанции = 0 Тогда
		ПроверитьНенастроенныеСтанции(Токен);
	КонецЕсли;

	// --- 3. Загруженные документы из 1С ---
	ЗагруженныеДокументы = ПолучитьЗагруженныеДокументы();

	// --- 4. Станции ---
	СтанцииДляЗагрузки = Новый Массив;
	Если КодСтанции > 0 Тогда
		СтанцииДляЗагрузки.Добавить(КодСтанции);
	Иначе
		СтанцииДляЗагрузки.Добавить(0);
	КонецЕсли;

	// --- 4. Для каждой станции получить смены ---
	Для Каждого СтанцияКод Из СтанцииДляЗагрузки Цикл

		ОтветСмены = TL_ApiКлиент.ПолучитьСписокСмен(URLСервера, Токен, КодСистемы, СтанцияКод);
		Смены = НормализоватьОтветСмен(ОтветСмены);
		ДобавитьВЛогСервер("Станция " + XMLСтрока(СтанцияКод) + ": смен " + Смены.Количество());

		Для Каждого ЭлементСмены Из Смены Цикл

			НомерСмены = Число(TL_ApiКлиент.ПолучитьЗначение(ЭлементСмены, "shift", 0));
			СтанцияИзОтвета = Число(TL_ApiКлиент.ПолучитьЗначение(ЭлементСмены, "station", СтанцияКод));

			ДатаСмены = TL_ApiКлиент.ПолучитьДатуИзДанных(ЭлементСмены, "dt_open");
			Если Не ЗначениеЗаполнено(ДатаСмены) Тогда
				ДатаСмены = TL_ApiКлиент.ПолучитьДатуИзДанных(ЭлементСмены, "date");
			КонецЕсли;

			// Нормализация финансового дня (смена закрытая в 07:00 → предыдущий день)
			ДатаСмены = TL_Настройки.НормализоватьДатуСмены(ДатаСмены, СтанцияИзОтвета);

			// Фильтр по периоду
			Если ЗначениеЗаполнено(ДатаСмены) Тогда
				Если ДатаСмены < НачалоДня(ДатаНачала) ИЛИ ДатаСмены > КонецДня(ДатаОкончания) Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;

			// --- Смены ---
			Если ТипДокументаФильтр = "Все" ИЛИ ТипДокументаФильтр = "Смены" Тогда

				Отчёт = TL_ApiКлиент.ПолучитьСменныйОтчёт(
					URLСервера, Токен, КодСистемы, СтанцияИзОтвета, НомерСмены);

				КлючСмены = "TL|СМЕНА|" + XMLСтрока(КодСистемы)
					+ "|" + XMLСтрока(СтанцияИзОтвета)
					+ "|" + XMLСтрока(НомерСмены);

				Описание = "Смена №" + XMLСтрока(НомерСмены);
				СуммаИтого = ВычислитьСуммуСмены(Отчёт);

				ДанныеJSON = "";
				Если Отчёт <> Неопределено Тогда
					Если ТипЗнч(Отчёт) = Тип("Соответствие") Тогда
						Отчёт.Вставить("station", СтанцияИзОтвета);
					КонецЕсли;
					ДанныеJSON = TL_ApiКлиент.ОбъектВJSON(Отчёт);
				КонецЕсли;

				ИнфоДок = ЗагруженныеДокументы.Получить(КлючСмены);
				Если ИнфоДок <> Неопределено Тогда
					ДобавитьВнутреннюю(КлючСмены, КлючСмены, "Смена", ДатаСмены,
						СтанцияИзОтвета, Описание, СуммаИтого, ИнфоДок);
				Иначе
					ДобавитьВнешнюю("Смена", ДатаСмены, СтанцияИзОтвета,
						НомерСмены, Описание, СуммаИтого, КлючСмены, ДанныеJSON);
				КонецЕсли;

			КонецЕсли;

			// --- ТТН ---
			Если ТипДокументаФильтр = "Все" ИЛИ ТипДокументаФильтр = "ТТН" Тогда

				Поступления = TL_ApiКлиент.ПолучитьПоступления(
					URLСервера, Токен, КодСистемы, СтанцияИзОтвета, НомерСмены);

				Для Каждого ЭлементТТН Из Поступления Цикл

					НомерТТН = Строка(TL_ApiКлиент.ПолучитьЗначение(ЭлементТТН, "ttn", ""));
					КодТоплива = Строка(TL_ApiКлиент.ПолучитьЗначение(ЭлементТТН, "fuel", ""));

					// Парсим doc.volume/doc.amount (новый формат) или doc_volume/amount (старый)
					ДокДанные = TL_ApiКлиент.ПолучитьЗначение(ЭлементТТН, "doc", Неопределено);
					Если ДокДанные <> Неопределено Тогда
						МассаКг = Число(TL_ApiКлиент.ПолучитьЗначение(ДокДанные, "amount", 0));
						СуммаТТН = Число(TL_ApiКлиент.ПолучитьЗначение(ДокДанные, "cost", 0));
					Иначе
						МассаКг = Число(TL_ApiКлиент.ПолучитьЗначение(ЭлементТТН, "doc_volume", 0)) * 1000;
						СуммаТТН = Число(TL_ApiКлиент.ПолучитьЗначение(ЭлементТТН, "amount", 0));
					КонецЕсли;
					МассаТонн = МассаКг / 1000;

					ДатаТТН = TL_ApiКлиент.ПолучитьДатуИзДанных(ЭлементТТН, "date");
					Если Не ЗначениеЗаполнено(ДатаТТН) Тогда
						ДатаТТН = ДатаСмены;
					КонецЕсли;

					КлючТТН = "TL|ТТН|" + XMLСтрока(КодСистемы)
						+ "|" + XMLСтрока(СтанцияИзОтвета)
						+ "|" + НомерТТН;

					ИмяТоплива = TL_Настройки.ПолучитьНаименованиеТоплива(КодТоплива);
					ОписаниеТТН = "ТТН №" + НомерТТН + " " + ИмяТоплива
						+ " " + Формат(МассаТонн, "ЧДЦ=3") + "т";

					Если ТипЗнч(ЭлементТТН) = Тип("Соответствие") Тогда
						ЭлементТТН.Вставить("station", СтанцияИзОтвета);
					КонецЕсли;
					ДанныеТТНJSON = TL_ApiКлиент.ОбъектВJSON(ЭлементТТН);

					ИнфоДок = ЗагруженныеДокументы.Получить(КлючТТН);
					Если ИнфоДок <> Неопределено Тогда
						ДобавитьВнутреннюю(КлючТТН, КлючТТН, "ТТН", ДатаТТН,
							СтанцияИзОтвета, ОписаниеТТН, СуммаТТН, ИнфоДок);
					Иначе
						ДобавитьВнешнюю("ТТН", ДатаТТН, СтанцияИзОтвета,
							НомерСмены, ОписаниеТТН, СуммаТТН, КлючТТН, ДанныеТТНJSON);
					КонецЕсли;

				КонецЦикла;

			КонецЕсли;

		КонецЦикла;

	КонецЦикла;

	ВнешниеДанные.Сортировать("Дата УБЫВ");
	ВнутренниеДанные.Сортировать("Дата УБЫВ, КлючБазовый, ТипДокумента");

	// --- 5. Обновить HTML-дашборд ---
	ОбновитьДашборд();

КонецПроцедуры

// ==========================================================================
//  ЗАГРУЗКА ВЫБРАННЫХ (правая → левая панель)
// ==========================================================================

&НаСервере
Процедура ЗагрузитьВыбранныеНаСервере()

	Счётчик = 0;
	ИндексыУдаления = Новый Массив;

	Для Инд = 0 По ВнешниеДанные.Количество() - 1 Цикл

		Стр = ВнешниеДанные[Инд];

		Если Не Стр.Отметка Тогда
			Продолжить;
		КонецЕсли;

		Результат = Неопределено;

		Если Стр.ТипДокумента = "Смена" Тогда
			Результат = TL_СозданиеДокументов.ОбработатьСмену(
				Стр.ДанныеJSON, Стр.КлючЗагрузки, Ложь);
		ИначеЕсли Стр.ТипДокумента = "ТТН" Тогда
			Результат = TL_СозданиеДокументов.ОбработатьТТН(
				Стр.ДанныеJSON, Стр.КлючЗагрузки, Ложь);
		КонецЕсли;

		Если Результат <> Неопределено Тогда
			Для Каждого ТекстОшибки Из Результат.Ошибки Цикл
				ДобавитьВЛогСервер("Ошибка: " + ТекстОшибки);
			КонецЦикла;

			Если Результат.Документы.Количество() > 0 Тогда
				// Основной документ
				НоваяСтр = ВнутренниеДанные.Добавить();
				НоваяСтр.Отметка              = Ложь;
				НоваяСтр.ТипДокумента         = Стр.ТипДокумента;
				НоваяСтр.Дата                 = Стр.Дата;
				НоваяСтр.Станция              = Стр.Станция;
				НоваяСтр.Описание             = Стр.Описание;
				НоваяСтр.Сумма                = Стр.Сумма;
				НоваяСтр.Статус               = "Загружен";
				НоваяСтр.КлючЗагрузки        = Стр.КлючЗагрузки;
				НоваяСтр.КлючБазовый          = Стр.КлючЗагрузки;
				НоваяСтр.ДанныеJSON           = Стр.ДанныеJSON; // Сохраняем для деталей
				НоваяСтр.ДокументПредставление = Строка(Результат.Документы[0]);

				// Дочерние документы (Перемещения, Комплектация) не показываем —
				// они видны в деталях основного документа (смены или ТТН).

				ИндексыУдаления.Добавить(Инд);
				Счётчик = Счётчик + 1;
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;

	Сч = ИндексыУдаления.Количество() - 1;
	Пока Сч >= 0 Цикл
		ВнешниеДанные.Удалить(ИндексыУдаления[Сч]);
		Сч = Сч - 1;
	КонецЦикла;

	ВнутренниеДанные.Сортировать("Дата УБЫВ, КлючБазовый, ТипДокумента");
	ДобавитьВЛогСервер("Загружено: " + XMLСтрока(Счётчик)
		+ " (документов в 1С: " + ВнутренниеДанные.Количество() + ")");
	ОбновитьДашборд();

КонецПроцедуры

// ==========================================================================
//  ПРОВЕДЕНИЕ / РАСПРОВЕДЕНИЕ / УДАЛЕНИЕ
// ==========================================================================

// Проведение: атомарно по КлючБазовый.
// Каждый пакет — в отдельной транзакции. Если один документ в пакете не провёлся —
// вся транзакция откатывается и ни один документ пакета не проводится.
//
&НаСервере
Процедура ПровестиВыбранныеНаСервере()

	Счётчик = 0;
	Ошибок = 0;

	// Собрать уникальные базовые ключи
	КлючиДляПроведения = Новый Соответствие;
	Для Каждого Стр Из ВнутренниеДанные Цикл
		Если Стр.Отметка И Стр.Статус <> "Проведён" Тогда
			КлючиДляПроведения.Вставить(Стр.КлючБазовый, Истина);
		КонецЕсли;
	КонецЦикла;

	// Проведение: находим все документы по базовому ключу из регистра
	// (включая дочерние Перемещения/Комплектации, которые не показаны в таблице)
	Для Каждого КлючПакета Из КлючиДляПроведения Цикл

		НачатьТранзакцию();
		Попытка
			СчётчикПакета = 0;

			// Получить все документы пакета из регистра (базовый + дочерние)
			ДокументыПакета = TL_РегистрСтатусов.ПолучитьДокументыПоБазовомуКлючу(КлючПакета.Ключ);

			Для Каждого ИнфоДок Из ДокументыПакета Цикл
				Если Не ЗначениеЗаполнено(ИнфоДок.Ссылка) Тогда
					Продолжить;
				КонецЕсли;
				ДокОбъект = ИнфоДок.Ссылка.ПолучитьОбъект();
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
				TL_РегистрСтатусов.ОбновитьСтатус(ИнфоДок.Ключ, "Проведён");
				СчётчикПакета = СчётчикПакета + 1;
			КонецЦикла;

			ЗафиксироватьТранзакцию();

			// Транзакция прошла — обновляем UI
			Для Каждого Стр Из ВнутренниеДанные Цикл
				Если Стр.КлючБазовый = КлючПакета.Ключ И Стр.Статус <> "Проведён" Тогда
					Стр.Статус = "Проведён";
					Стр.Отметка = Ложь;
				КонецЕсли;
			КонецЦикла;
			Счётчик = Счётчик + СчётчикПакета;

		Исключение
			ОтменитьТранзакцию();
			ДобавитьВЛогСервер("Пакет " + КлючПакета.Ключ + " откачен: " + ОписаниеОшибки());
			Ошибок = Ошибок + 1;
		КонецПопытки;

	КонецЦикла;

	ДобавитьВЛогСервер("Проведено: " + XMLСтрока(Счётчик)
		+ ?(Ошибок > 0, ", пакетов с ошибками: " + XMLСтрока(Ошибок), ""));
	ОбновитьДашборд();

КонецПроцедуры

// Распроведение: атомарно по КлючБазовый.
// Обратный порядок: Смена → Комплектация → Перемещение → ТТН.
// Каждый пакет в транзакции — при ошибке откатывается весь.
//
&НаСервере
Процедура РаспровестиВыбранныеНаСервере()

	Счётчик = 0;
	Ошибок = 0;

	КлючиДляРаспроведения = Новый Соответствие;
	Для Каждого Стр Из ВнутренниеДанные Цикл
		Если Стр.Отметка И Стр.Статус = "Проведён" Тогда
			КлючиДляРаспроведения.Вставить(Стр.КлючБазовый, Истина);
		КонецЕсли;
	КонецЦикла;

	ПорядокТипов = Новый Массив;
	ПорядокТипов.Добавить("Смена");
	ПорядокТипов.Добавить("Комплектация");
	ПорядокТипов.Добавить("Перемещение");
	ПорядокТипов.Добавить("ТТН");

	Для Каждого КлючПакета Из КлючиДляРаспроведения Цикл

		НачатьТранзакцию();
		Попытка
			СчётчикПакета = 0;

			Для Каждого ТипДок Из ПорядокТипов Цикл
				Для Каждого Стр Из ВнутренниеДанные Цикл
					Если Стр.КлючБазовый <> КлючПакета.Ключ
						ИЛИ Стр.Статус <> "Проведён"
						ИЛИ Стр.ТипДокумента <> ТипДок Тогда
						Продолжить;
					КонецЕсли;

					ДокСсылка = TL_РегистрСтатусов.НайтиДокументПоКлючу(Стр.КлючЗагрузки);
					Если Не ЗначениеЗаполнено(ДокСсылка) Тогда
						ВызватьИсключение "Документ не найден: " + Стр.КлючЗагрузки;
					КонецЕсли;

					ДокОбъект = ДокСсылка.ПолучитьОбъект();
					ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					TL_РегистрСтатусов.ОбновитьСтатус(Стр.КлючЗагрузки, "Загружен");
					СчётчикПакета = СчётчикПакета + 1;
				КонецЦикла;
			КонецЦикла;

			ЗафиксироватьТранзакцию();

			Для Каждого Стр Из ВнутренниеДанные Цикл
				Если Стр.КлючБазовый = КлючПакета.Ключ И Стр.Статус = "Проведён" Тогда
					Стр.Статус = "Загружен";
					Стр.Отметка = Ложь;
				КонецЕсли;
			КонецЦикла;
			Счётчик = Счётчик + СчётчикПакета;

		Исключение
			ОтменитьТранзакцию();
			ДобавитьВЛогСервер("Пакет " + КлючПакета.Ключ + " откачен: " + ОписаниеОшибки());
			Ошибок = Ошибок + 1;
		КонецПопытки;

	КонецЦикла;

	ДобавитьВЛогСервер("Распроведено: " + XMLСтрока(Счётчик)
		+ ?(Ошибок > 0, ", пакетов с ошибками: " + XMLСтрока(Ошибок), ""));
	ОбновитьДашборд();

КонецПроцедуры

// Удаление: атомарно по КлючБазовый.
// Каждый пакет в транзакции — если один документ не удалился, весь пакет откатывается.
//
&НаСервере
Процедура УдалитьВыбранныеНаСервере()

	Счётчик = 0;
	Ошибок = 0;

	КлючиДляУдаления = Новый Соответствие;
	Для Каждого Стр Из ВнутренниеДанные Цикл
		Если Стр.Отметка Тогда
			КлючиДляУдаления.Вставить(Стр.КлючБазовый, Истина);
		КонецЕсли;
	КонецЦикла;

	УспешныеПакеты = Новый Массив; // Ключи успешно удалённых пакетов

	Для Каждого КлючПакета Из КлючиДляУдаления Цикл

		НачатьТранзакцию();
		Попытка
			// Удаляем ВСЕ документы и записи по базовому ключу (включая дочерние |ПЕРЕМ, |КОМПЛ)
			ДокументыПакета = TL_РегистрСтатусов.ПолучитьДокументыПоБазовомуКлючу(КлючПакета.Ключ);
			Для Каждого ИнфоДок Из ДокументыПакета Цикл
				Если ЗначениеЗаполнено(ИнфоДок.Ссылка) Тогда
					ДокОбъект = ИнфоДок.Ссылка.ПолучитьОбъект();
					Если ДокОбъект.Проведен Тогда
						ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					КонецЕсли;
					ДокОбъект.УстановитьПометкуУдаления(Истина);
				КонецЕсли;
				TL_РегистрСтатусов.УдалитьЗапись(ИнфоДок.Ключ);
			КонецЦикла;
			// Удалить базовый ключ тоже (если не в списке дочерних)
			TL_РегистрСтатусов.УдалитьЗапись(КлючПакета.Ключ);

			ЗафиксироватьТранзакцию();
			УспешныеПакеты.Добавить(КлючПакета.Ключ);

		Исключение
			ОтменитьТранзакцию();
			ДобавитьВЛогСервер("Пакет " + КлючПакета.Ключ + " не удалён: " + ОписаниеОшибки());
			Ошибок = Ошибок + 1;
		КонецПопытки;

	КонецЦикла;

	// Удалить строки из таблицы только для успешных пакетов
	Инд = ВнутренниеДанные.Количество() - 1;
	Пока Инд >= 0 Цикл
		Стр = ВнутренниеДанные[Инд];
		Для Каждого УспешныйКлюч Из УспешныеПакеты Цикл
			Если Стр.КлючБазовый = УспешныйКлюч Тогда
				ВнутренниеДанные.Удалить(Инд);
				Счётчик = Счётчик + 1;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Инд = Инд - 1;
	КонецЦикла;

	ДобавитьВЛогСервер("Помечено на удаление: " + XMLСтрока(Счётчик)
		+ ?(Ошибок > 0, ", пакетов с ошибками: " + XMLСтрока(Ошибок), ""));
	ОбновитьДашборд();

КонецПроцедуры

// ==========================================================================
//  НАСТРОЙКИ И ПОИСК ДОКУМЕНТОВ
// ==========================================================================

&НаСервере
Функция ПолучитьЗагруженныеДокументы()
	Возврат TL_РегистрСтатусов.ПолучитьЗагруженныеДокументы(ДатаНачала, ДатаОкончания);
КонецФункции

&НаСервере
Процедура ЗагрузитьНастройки()
	URLСервера = TL_Настройки.ПолучитьЗначение("URLСервера", "");
	Логин      = TL_Настройки.ПолучитьЗначение("Логин", "");
	Пароль     = TL_Настройки.ПолучитьЗначение("Пароль", "");
	КодСистемы = TL_Настройки.ПолучитьЧисло("КодСистемы", 0);
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()
	TL_Настройки.УстановитьЗначение("URLСервера", URLСервера, "URL API STS");
	TL_Настройки.УстановитьЗначение("Логин", Логин, "Логин API");
	TL_Настройки.УстановитьЗначение("Пароль", Пароль, "Пароль API");
	TL_Настройки.УстановитьЗначение("КодСистемы", XMLСтрока(КодСистемы), "Код системы");
КонецПроцедуры

// Открыть HTML-настройки в панели деталей
&НаСервере
Процедура ОткрытьНастройкиНаСервере()

	// Собрать текущие настройки в JSON
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Ключ, Значение ИЗ РегистрСведений.TL_Настройки";

	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
	Исключение
		HTMLДетали = TL_HTMLГенератор.СформироватьНастройки("");
		Возврат;
	КонецПопытки;

	Данные = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		Данные.Вставить(Выборка.Ключ, Выборка.Значение);
	КонецЦикла;

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные);
	СтрокаJSON = ЗаписьJSON.Закрыть();

	HTMLДетали = TL_HTMLГенератор.СформироватьНастройки(СтрокаJSON);

КонецПроцедуры

// Сохранить настройки из HTML-формы (JSON от клиента)
&НаСервере
Процедура СохранитьНастройкиИзHTML(СтрокаJSON)

	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
		Данные = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		Возврат;
	КонецПопытки;

	Для Каждого КлючЗначение Из Данные Цикл
		TL_Настройки.УстановитьЗначение(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;

	// Обновить локальные реквизиты формы
	ЗагрузитьНастройки();

КонецПроцедуры

// ==========================================================================
//  ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ
// ==========================================================================

// Добавить строку во ВнутренниеДанные (левая панель).
//
&НаСервере
Процедура ДобавитьВнутреннюю(КлючЗагрузки, КлючБазовый, ТипДокумента, Дата, Станция, Описание, Сумма, ИнфоДок)
	Стр = ВнутренниеДанные.Добавить();
	Стр.Отметка              = Ложь;
	Стр.КлючЗагрузки        = КлючЗагрузки;
	Стр.КлючБазовый          = КлючБазовый;
	Стр.ТипДокумента         = ТипДокумента;
	Стр.Дата                 = Дата;
	Стр.Станция              = Станция;
	Стр.Описание             = Описание;
	Стр.Сумма                = Сумма;
	Стр.Статус               = ИнфоДок.Статус;
	Стр.ДокументПредставление = Строка(ИнфоДок.Ссылка);
КонецПроцедуры

// Добавить строку во ВнешниеДанные (правая панель).
//
&НаСервере
Процедура ДобавитьВнешнюю(ТипДокумента, Дата, Станция, НомерСмены, Описание, Сумма, КлючЗагрузки, ДанныеJSON)
	Стр = ВнешниеДанные.Добавить();
	Стр.Отметка       = Ложь;
	Стр.ТипДокумента  = ТипДокумента;
	Стр.Дата          = Дата;
	Стр.Станция       = Станция;
	Стр.НомерСмены    = НомерСмены;
	Стр.Описание      = Описание;
	Стр.Сумма         = Сумма;
	Стр.КлючЗагрузки = КлючЗагрузки;
	Стр.ДанныеJSON    = ДанныеJSON;
КонецПроцедуры

// Найти связанные документы (Перемещения, Комплектации) по базовому ключу.
//
&НаСервере
Процедура ДобавитьСвязанныеДокументы(КлючБазовый, ЗагруженныеДокументы)
	Для Каждого КЗ Из ЗагруженныеДокументы Цикл
		Если СтрНачинаетсяС(КЗ.Ключ, КлючБазовый + "|") Тогда
			// Это дочерний документ (|ПЕРЕМ, |КОМПЛ, |cash|92 и т.д.)
			Инфо = КЗ.Значение;
			ТипДоч = ОпределитьТипПоКлючу(КЗ.Ключ);
			ОписДоч = ОпределитьОписаниеПоКлючу(КЗ.Ключ);

			Стр = ВнутренниеДанные.Добавить();
			Стр.Отметка              = Ложь;
			Стр.КлючЗагрузки        = КЗ.Ключ;
			Стр.КлючБазовый          = КлючБазовый;
			Стр.ТипДокумента         = "  " + ТипДоч;
			Стр.Описание             = "  " + ОписДоч;
			Стр.Статус               = Инфо.Статус;
			Стр.ДокументПредставление = Строка(Инфо.Ссылка);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Нормализовать ответ API со списком смен (3 формата).
//
&НаСервере
Функция НормализоватьОтветСмен(ОтветСмены)

	Смены = Новый Массив;

	Если ТипЗнч(ОтветСмены) = Тип("Массив") Тогда
		Если ОтветСмены.Количество() > 0 Тогда
			Первый = ОтветСмены[0];
			Если ТипЗнч(Первый) = Тип("Соответствие") И Первый.Получить("shift") <> Неопределено Тогда
				Смены = ОтветСмены;
			ИначеЕсли ТипЗнч(Первый) = Тип("Соответствие") И Первый.Получить("shifts") <> Неопределено Тогда
				Вложенные = Первый.Получить("shifts");
				Если ТипЗнч(Вложенные) = Тип("Массив") Тогда
					Смены = Вложенные;
				КонецЕсли;
			Иначе
				Смены = ОтветСмены;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ОтветСмены) = Тип("Соответствие") Тогда
		Вложенные = ОтветСмены.Получить("shifts");
		Если ТипЗнч(Вложенные) = Тип("Массив") Тогда
			Смены = Вложенные;
		КонецЕсли;
	КонецЕсли;

	Возврат Смены;

КонецФункции

// Проверить наличие ненастроенных станций в API.
// Если найдены — записать предупреждение в лог с кодами.
//
&НаСервере
Процедура ПроверитьНенастроенныеСтанции(Токен)

	Попытка
		ВсеСтанции = TL_ApiКлиент.ПолучитьСписокСтанций(URLСервера, Токен, КодСистемы);
	Исключение
		Возврат;
	КонецПопытки;

	Если ВсеСтанции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Ненастроенные = Новый Массив;
	Для Каждого КодСт Из ВсеСтанции Цикл
		Склад = TL_Настройки.НайтиСкладСтанции(КодСт);
		Если Не ЗначениеЗаполнено(Склад) Тогда
			Ненастроенные.Добавить(XMLСтрока(КодСт));
		КонецЕсли;
	КонецЦикла;

	Если Ненастроенные.Количество() > 0 Тогда
		ДобавитьВЛогСервер("Обнаружены ненастроенные станции: "
			+ СтрСоединить(Ненастроенные, ", ")
			+ ". Откройте Настройки расширения для подключения.");
	КонецЕсли;

КонецПроцедуры

// Определить тип документа по суффиксу ключа.
//
&НаСервере
Функция ОпределитьТипПоКлючу(Ключ)
	Если СтрНайти(Ключ, "|КОМПЛ") > 0 Тогда
		Возврат "Комплектация";
	ИначеЕсли СтрНайти(Ключ, "|ПЕРЕМ") > 0 Тогда
		Возврат "Перемещение";
	Иначе
		Возврат "Перемещение";
	КонецЕсли;
КонецФункции

// Определить описание по суффиксу ключа.
//
&НаСервере
Функция ОпределитьОписаниеПоКлючу(Ключ)
	Если СтрНайти(Ключ, "|КОМПЛ") > 0 Тогда
		Возврат "т → л";
	ИначеЕсли СтрНайти(Ключ, "|ПЕРЕМ") > 0 Тогда
		Возврат "→ АЗС";
	Иначе
		// Перемещение по оплате: ключ = TL|СМЕНА|65|5|91|online|2
		Части = СтрРазделить(Ключ, "|");
		Если Части.Количество() > 6 Тогда
			Канал = Части[Части.Количество() - 2];
			КодТопл = Части[Части.Количество() - 1];
			ИмяТопл = TL_Настройки.ПолучитьНаименованиеТоплива(КодТопл);
			Возврат "→ " + ВРег(Канал) + ", " + ИмяТопл;
		ИначеЕсли Части.Количество() > 5 Тогда
			Возврат "→ " + ВРег(Части[Части.Количество() - 2]);
		КонецЕсли;
		Возврат "→ склад";
	КонецЕсли;
КонецФункции

// Определить тип документа 1С по ссылке.
//
&НаСервере
Функция ОпределитьТипДокумента(ДокСсылка)
	ИмяТипа = Строка(ТипЗнч(ДокСсылка));
	Если СтрНайти(ИмяТипа, "Перемещение") > 0 Тогда
		Возврат "Перемещение";
	ИначеЕсли СтрНайти(ИмяТипа, "Комплектация") > 0 Тогда
		Возврат "Комплектация";
	ИначеЕсли СтрНайти(ИмяТипа, "Поступление") > 0 Тогда
		Возврат "ТТН";
	Иначе
		Возврат "Документ";
	КонецЕсли;
КонецФункции

// Определить описание дочернего документа.
//
&НаСервере
Функция ОпределитьОписаниеДочернего(ДокСсылка, ТипДоч)
	Если ТипДоч = "Комплектация" Тогда
		Возврат "т → л";
	ИначеЕсли ТипДоч = "Перемещение" Тогда
		Возврат "→ склад";
	Иначе
		Возврат Строка(ДокСсылка);
	КонецЕсли;
КонецФункции

// Найти ключ загрузки по ссылке документа (обратный поиск).
//
&НаСервере
Функция НайтиКлючПоДокументу(ДокСсылка)
	Попытка
		ДокОбъект = ДокСсылка.ПолучитьОбъект();
		Комментарий = ДокОбъект.Комментарий;
		ПозРазделителя = СтрНайти(Комментарий, " | ");
		Если ПозРазделителя > 0 Тогда
			Возврат Лев(Комментарий, ПозРазделителя - 1);
		КонецЕсли;
		Возврат СокрЛП(Комментарий);
	Исключение
		Возврат "";
	КонецПопытки;
КонецФункции

// Обновить HTML-дашборд (KPI-карточки).
//
&НаСервере
Процедура ОбновитьДашборд()

	ВсегоСмен = ВнешниеДанные.Количество() + ВнутренниеДанные.Количество();
	Загружено = ВнутренниеДанные.Количество();
	Новых = ВнешниеДанные.Количество();

	// Подсчёт ошибок (документы без ссылки или с проблемами)
	Ошибок = 0;

	// Сумма за период
	СуммаЗаПериод = 0;
	Для Каждого Стр Из ВнешниеДанные Цикл
		СуммаЗаПериод = СуммаЗаПериод + Стр.Сумма;
	КонецЦикла;
	Для Каждого Стр Из ВнутренниеДанные Цикл
		// Считаем только основные документы (Смена, ТТН), не дочерние
		Если Стр.ТипДокумента = "Смена" ИЛИ Стр.ТипДокумента = "ТТН" Тогда
			СуммаЗаПериод = СуммаЗаПериод + Стр.Сумма;
		КонецЕсли;
	КонецЦикла;

	HTMLДашборд = TL_HTMLГенератор.СформироватьДашборд(ВсегоСмен, Загружено, Новых, Ошибок, СуммаЗаПериод);

КонецПроцедуры

// ==========================================================================
//  СЕРВЕРНЫЕ ОБЁРТКИ ДЛЯ HTML-ДЕТАЛЕЙ
//  (HTMLГенератор — серверный модуль, нужны обёртки для вызова с клиента)
// ==========================================================================

// Обновить детали для внешнего документа (правая панель).
//
&НаСервере
Процедура ОбновитьДеталиВнешнегоДокумента(ТипДокумента, ДанныеJSON, Заголовок)

	Если ТипДокумента = "Смена" И ЗначениеЗаполнено(ДанныеJSON) Тогда
		HTMLДетали = TL_HTMLГенератор.СформироватьДеталиСмены(ДанныеJSON, Заголовок);
	ИначеЕсли ТипДокумента = "ТТН" И ЗначениеЗаполнено(ДанныеJSON) Тогда
		HTMLДетали = TL_HTMLГенератор.СформироватьДеталиТТН(ДанныеJSON, Заголовок);
	Иначе
		HTMLДетали = TL_HTMLГенератор.ПустыеДетали();
	КонецЕсли;

КонецПроцедуры

// Обновить детали для внутреннего документа (левая панель) со связанными.
//
&НаСервере
Процедура ОбновитьДеталиВнутреннегоДокумента(КлючБазовый, ДанныеJSON, Заголовок, СвязанныеДокументы)

	Если СтрНайти(КлючБазовый, "|СМЕНА|") > 0 Тогда
		HTMLДетали = TL_HTMLГенератор.СформироватьДеталиСмены(
			ДанныеJSON, Заголовок, СвязанныеДокументы);
	ИначеЕсли СтрНайти(КлючБазовый, "|ТТН|") > 0 Тогда
		HTMLДетали = TL_HTMLГенератор.СформироватьДеталиТТН(
			ДанныеJSON, Заголовок, СвязанныеДокументы);
	Иначе
		HTMLДетали = TL_HTMLГенератор.ПустыеДетали();
	КонецЕсли;

КонецПроцедуры

// Показать пустые детали.
//
&НаСервере
Процедура ОбновитьДеталиПустые()
	HTMLДетали = TL_HTMLГенератор.ПустыеДетали();
КонецПроцедуры

// Найти JSON по ключу: сначала в ВнутренниеДанные, потом ВнешниеДанные.
//
&НаКлиенте
Функция НайтиJSONПоКлючу(КлючБазовый)

	// 1. Ищем в левой панели (ВнутренниеДанные — JSON сохраняется при загрузке)
	Для Каждого Стр Из ВнутренниеДанные Цикл
		Если Стр.КлючЗагрузки = КлючБазовый И ЗначениеЗаполнено(Стр.ДанныеJSON) Тогда
			Возврат Стр.ДанныеJSON;
		КонецЕсли;
	КонецЦикла;

	// 2. Ищем в правой панели (ВнешниеДанные)
	Для Каждого Стр Из ВнешниеДанные Цикл
		Если Стр.КлючЗагрузки = КлючБазовый Тогда
			Возврат Стр.ДанныеJSON;
		КонецЕсли;
	КонецЦикла;

	Возврат "";

КонецФункции

// Вычислить итоговую сумму смены.
//
&НаСервере
Функция ВычислитьСуммуСмены(ДанныеОтчёта)

	Если ДанныеОтчёта = Неопределено Тогда
		Возврат 0;
	КонецЕсли;

	// 1. Из sales с фильтрацией купонов (совпадает с тем что загрузится в 1С)
	Если ТипЗнч(ДанныеОтчёта) = Тип("Соответствие") Тогда
		МассивПродаж = ДанныеОтчёта.Получить("sales");
		Если ТипЗнч(МассивПродаж) = Тип("Массив") И МассивПродаж.Количество() > 0 Тогда
			Итого = 0;
			Для Каждого Продажа Из МассивПродаж Цикл
				// Фильтруем купоны — так же как при создании документов
				ТипОплаты = TL_ApiКлиент.ПолучитьЗначение(Продажа, "pay_type", Неопределено);
				Если ТипОплаты <> Неопределено Тогда
					ИмяОпл = НРег(Строка(TL_ApiКлиент.ПолучитьЗначение(ТипОплаты, "name", "")));
					Если СтрНайти(ИмяОпл, "купон") > 0 Тогда
						Продолжить; // Купоны — сервисный, не учитываем в итоге
					КонецЕсли;
				КонецЕсли;

				МассивТоплива = TL_ApiКлиент.ПолучитьЗначение(Продажа, "fuel", Неопределено);
				Если ТипЗнч(МассивТоплива) = Тип("Массив") Тогда
					Для Каждого ЭлементТоплива Из МассивТоплива Цикл
						Выпуск = TL_ApiКлиент.ПолучитьЗначение(ЭлементТоплива, "release", Неопределено);
						Если Выпуск <> Неопределено Тогда
							Попытка
								Итого = Итого + Число(TL_ApiКлиент.ПолучитьЗначение(Выпуск, "cost", 0));
							Исключение
							КонецПопытки;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
			Если Итого > 0 Тогда Возврат Итого; КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	// 2. Fallback: totals.summ_total (может включать купоны, но лучше чем ничего)
	Если ТипЗнч(ДанныеОтчёта) = Тип("Соответствие") Тогда
		Итоги = ДанныеОтчёта.Получить("totals");
		Если ТипЗнч(Итоги) = Тип("Соответствие") Тогда
			Попытка
				С = Число(Итоги.Получить("summ_total"));
				Если С > 0 Тогда Возврат С; КонецЕсли;
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;

	// 3. Fallback: payments (старый формат)
	Если ТипЗнч(ДанныеОтчёта) = Тип("Соответствие") Тогда
		Оплаты = ДанныеОтчёта.Получить("payments");
		Если ТипЗнч(Оплаты) = Тип("Соответствие") Тогда
			Итого = 0;
			Для Каждого КЗ Из Оплаты Цикл
				Попытка Итого = Итого + Число(КЗ.Значение); Исключение КонецПопытки;
			КонецЦикла;
			Возврат Итого;
		КонецЕсли;
	КонецЕсли;

	Возврат 0;

КонецФункции

&НаКлиенте
Функция ПроверитьНастройки()
	Если Не ЗначениеЗаполнено(URLСервера) Тогда
		ДобавитьВЛог("Заполните URL сервера");
		Возврат Ложь;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Логин) ИЛИ Не ЗначениеЗаполнено(Пароль) Тогда
		ДобавитьВЛог("Заполните логин и пароль");
		Возврат Ложь;
	КонецЕсли;
	Если КодСистемы = 0 Тогда
		ДобавитьВЛог("Укажите код системы");
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ПереключитьОтметки(Таблица)
	ЕстьОтмеченные = Ложь;
	Для Каждого Стр Из Таблица Цикл
		Если Стр.Отметка Тогда ЕстьОтмеченные = Истина; Прервать; КонецЕсли;
	КонецЦикла;
	НовоеЗначение = Не ЕстьОтмеченные;
	Для Каждого Стр Из Таблица Цикл Стр.Отметка = НовоеЗначение; КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ПодсчитатьОтмеченные(Таблица)
	Счётчик = 0;
	Для Каждого Стр Из Таблица Цикл
		Если Стр.Отметка Тогда Счётчик = Счётчик + 1; КонецЕсли;
	КонецЦикла;
	Возврат Счётчик;
КонецФункции

&НаКлиенте
Процедура ДобавитьВЛог(Текст)
	Штамп = Формат(ТекущаяДата(), "ДФ='dd.MM HH:mm'");
	НоваяСтрока = Штамп + "  " + Текст;
	ТекстЛога = ?(ЗначениеЗаполнено(ТекстЛога), НоваяСтрока + Символы.ПС + ТекстЛога, НоваяСтрока);
КонецПроцедуры

&НаСервере
Процедура ДобавитьВЛогСервер(Текст)
	Штамп = Формат(ТекущаяДата(), "ДФ='dd.MM HH:mm'");
	НоваяСтрока = Штамп + "  " + Текст;
	ТекстЛога = ?(ЗначениеЗаполнено(ТекстЛога), НоваяСтрока + Символы.ПС + ТекстЛога, НоваяСтрока);
КонецПроцедуры

#КонецОбласти
